Revit 2015 API
TableSectionData.GetCellText Method
 Returns a cell's text depending on its type
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public string GetCellText(
	int nRow,
	int nCol
)
Visual Basic
Public Function GetCellText ( _
	nRow As Integer, _
	nCol As Integer _
) As String
Visual C++
public:
String^ GetCellText(
	int nRow,
	int nCol
)
Parameters
nRow
Type: System.Int32
nCol
Type: System.Int32
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The given row number nRow is invalid. -or- The given column number nCol is invalid.
See Also
TableSectionData Class
Autodesk.Revit.DB Namespace